[Ability_attaque_Prime.A_Nova H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="对敌方单位造成%d.min到%d.max点%dam.icon源力伤害。\n为英雄恢复10点%icon_mana法力。"
mName="英雄攻击"
mTooltip="对敌方单位造成%d.min到%d.max点%dam.icon源力伤害。"

[Ability_attaque_Prime_upg.A_Nova H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="对敌方单位造成%d.min到%d.max点%dam.icon源力伤害。\n为英雄恢复10点%icon_mana法力。"
mName="英雄攻击"
mTooltip="对敌方单位造成%d.min到%d.max点%dam.icon源力伤害。"

[confluxBuildingAbilities_setting.A_spell_up_Ability_building H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[Expert.A_ArcaneBrilliance_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="奥术奥秘"
mTooltip="增加英雄%stat点%stat.icon奥术知识。此外，英雄施放的法术等级提升1级。"

[Expert.A_ArcaneEmpowerment_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="元素坚韧"
mTooltip="每当英雄施放一个法术，弩车获得%buff1.buff.buff.buff.stat1点%icon_attack攻击和%buff1.buff.buff.buff.stat1点%icon_defense防御。"

[Expert.A_Conflux_expert_knowedge_buff H7BaseBuff]
mName="魔法拥抱"
mTooltip="英雄获得%stat1点%icon_stat1魔力%icon_magic，持续到下一个战斗回合结束。"

[Expert.A_warfare_skill_expert_Buff H7BaseBuff]
mName=""
mTooltip=""

[Expert.A_warfare_skill_expert_Buff_unit H7BaseBuff]
mName="元素坚韧"
mTooltip=""

[Grand_master.A_avantage_Buff H7BaseBuff]
mName="奥术调和"
mTooltip=""

[Master.A_ArcaneAttunement_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="奥术平衡"
mTooltip="力量英雄的魔力%icon_magic和精神%icon_spirit提升35%，\n魔法英雄的防御%icon_defense和攻击%icon_attack提升35%。"

[Master.A_equilbre_magic_Buff H7BaseBuff]
mName="奥术平衡"
mTooltip=""

[Master.A_equilbre_might_Buff H7BaseBuff]
mName="奥术平衡"
mTooltip=""

[Master.A_Marker_magic_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[Master.A_Marker_might_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[Novice.A_ArcaneCatalyst_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="元素学派"
mTooltip="气系%icon_air、火系%icon_fire、土系%icon_earth、水系%icon_water和源力%icon_prime法术消耗%special%% %icon_mana法力。"

[Novice.A_ArcaneChanneling_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="元素力量"
mTooltip="当英雄使用元素英雄攻击时，此次攻击忽略目标的防御。"

[Novice.A_ArcaneShield_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="元素之盾"
mTooltip="当生物使用防御动作时，它们受到来自气系%icon_air、土系%icon_earth、火系%icon_fire、水系%icon_water和源力%icon_prime的伤害减少%buff.buff.buff.buff.res1，持续到战斗回合结束。"

[Novice.A_Conflux_shield_defend_magic2 H7BaseBuff]
mName=""
mTooltip=""

[Novice.A_Conflux_shield_magic H7BaseBuff]
mName=""
mTooltip=""

[Skill_faction.A_Conflux_expert_air_debuff H7BaseBuff]
mName="风暴光环"
mTooltip="该生物在%durnow回合内造成%stat1点伤害。"

[Skill_faction.A_Conflux_expert_earth_buff H7BaseBuff]
mName="地卜师护甲"
mTooltip="英雄获得%stat1点%icon_stat1 %icon_defense防御和%icon_attack攻击，持续到下一个回合结束。"

[Skill_faction.A_Conflux_expert_fire_buff H7BaseBuff]
mName="魔法之吻"
mTooltip="英雄获得%stat1点%icon_stat1魔力，持续到下一个回合结束。"

[Skill_faction.A_Conflux_expert_prime_buff H7BaseBuff]
mName=""
mTooltip=""

[Skill_faction.A_Conflux_expert_prime_hero_buff H7BaseBuff]
mName="+10点%icon_mana法力"
mTooltip=""

[Skill_faction.A_Conflux_expert_rank_buff H7BaseBuff]
mName=""
mTooltip=""

[Novice.A_ArcaneChanneling_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="元素幸运"
mTooltip="战斗开始时，根据英雄军队中不同元素生物%icon_air %icon_water %icon_fire %icon_earth %icon_prime的数量，英雄获得%buff1.buff.buff.buff.stat点%icon_luck幸运。\n(对%icon_light光明和%icon_dark黑暗类型生物无效。)"

[Novice.A_Conflux_chance_air_hero H7BaseBuff]
mName="气之幸运"
mTooltip=""

[Novice.A_Conflux_chance_prime_hero H7BaseBuff]
mName="源力幸运"
mTooltip=""

[Novice.A_Conflux_chance_water_hero H7BaseBuff]
mName="水之幸运"
mTooltip=""

[Novice.A_Conflux_chance_earth_hero H7BaseBuff]
mName="土之幸运"
mTooltip=""

[Novice.A_Conflux_chance_fire_hero H7BaseBuff]
mName="火之幸运"
mTooltip=""

v1.36beta

[Ability_attaque_air.A_Nova H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="对敌方单位造成%d.min到%d.max点%dam.icon气系伤害。\n在3回合内减少敌方远程生物造成的伤害20%。"
mName="英雄攻击"
mTooltip="对敌方单位造成%d.min到%d.max点%dam.icon气系伤害。"

[Ability_attaque_air_upg.A_Nova H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="对敌方单位造成%d.min到%d.max点%dam.icon气系伤害。\n在3回合内减少敌方远程生物造成的伤害20%。"
mName="英雄攻击"
mTooltip="对敌方单位造成%d.min到%d.max点%dam.icon气系伤害。"

[Ability_attaque_Earth.A_Nova H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="对敌方单位造成%d.min到%d.max点%dam.icon土系伤害。\n在3回合内增加英雄7点攻击%icon_attack和%icon_defense防御。"
mName="英雄攻击"
mTooltip="对敌方单位造成%d.min到%d.max点%dam.icon土系伤害。"

[Ability_attaque_Earth_upg.A_Nova H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="对敌方单位造成%d.min到%d.max点%dam.icon土系伤害。\n在3回合内增加英雄7点攻击%icon_attack和%icon_defense防御。"
mName="英雄攻击"
mTooltip="对敌方单位造成%d.min到%d.max点%dam.icon土系伤害。"

[Ability_attaque_Fire.A_Nova H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="对敌方单位造成%d.min到%d.max点%dam.icon火系伤害。\n在3回合内增加英雄15点%icon_magic魔力。"
mName="英雄攻击"
mTooltip="对敌方单位造成%d.min到%d.max点%dam.icon火系伤害。"

[Ability_attaque_Fire_upg.A_Nova H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="对敌方单位造成%d.min到%d.max点%dam.icon火系伤害。\n在3回合内增加英雄15点%icon_magic魔力。"
mName="英雄攻击"
mTooltip="对敌方单位造成%d.min到%d.max点%dam.icon火系伤害。"

[Ability_attaque_Water.A_Nova H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="对敌方单位造成%d.min到%d.max点%dam.icon水系伤害。\n移除被攻击生物的所有正面效果。"
mName="英雄攻击"
mTooltip="对敌方单位造成%d.min到%d.max点%dam.icon水系伤害。"

[Ability_attaque_Water_upg.A_Nova H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="对敌方单位造成%d.min到%d.max点%dam.icon水系伤害。\n移除被攻击生物的所有正面效果。"
mName="英雄攻击"
mTooltip="对敌方单位造成%d.min到%d.max点%dam.icon水系伤害。"

[Skill_faction.A_Conflux_expert_water_debuff H7BaseBuff]
mName="魔法消除"
mTooltip="移除目标生物的所有正面效果。"

[Skill_faction.A_Metamagic_Skill H7Skill]
mDescriptions[0]="元素学者为英雄提供派系5种元素的特殊基础攻击。(气系%icon_air、火系%icon_fire、土系%icon_earth、水系%icon_water和源力%icon_prime)"
mDescriptions[1]=""
mDescriptions[2]="为法术书添加每个派系元素的元素英雄攻击。(气系%icon_air、火系%icon_fire、土系%icon_earth、水系%icon_water和源力%icon_prime)"
mDescriptions[3]="元素英雄攻击根据其元素产生效果。\n%icon_air气系：减少敌方远程生物造成的伤害20%。\n%icon_fire火系：在3回合内增加英雄15点%icon_magic魔力。\n%icon_earth土系：在3回合内增加英雄7点攻击%icon_attack和%icon_defense防御。\n%icon_water水系：移除被攻击生物的所有正面效果。\n%icon_prime源力：恢复英雄10点%icon_mana法力。"
mDescriptions[4]="敌方英雄的伤害和治疗法术效果降低%buff6.buff.res%。\n敌方生物的伤害和治疗主动效果降低%buff6.buff.res%。"
mName="元素学者"
mTooltip="元素派系技能"

v1.37

[Grand_master.A_ArcaneAmplification_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="元素反转"
mTooltip="敌方魔法伤害生物获得对其相克元素的脆弱性，如果原本没有的话\n%icon_air > %icon_water > %icon_fire > %icon_earth > %icon_air 和 %icon_light - %icon_dark\n此效果不与生物固有弱点叠加\n此外，英雄每点%ICON_ARCANE_KNOWLEDGE奥术知识获得+1 %ICON_Magic魔力(最大：+20魔力)。"

[Novice.A_Conflux_shield_defend_magic H7BaseBuff]
mName="元素护盾"
mTooltip="当生物使用防御动作时，它受到来自气系%icon_air、土系%icon_earth、火系%icon_fire、水系%icon_water和源力%icon_prime类型的远程攻击以及敌方英雄法术的伤害减少%res1，持续到下一个战斗回合结束。"

v1.40

[Skill_faction.A_Conflux_Master_rank_buff H7BaseBuff]
mName="魔法抑制"
mTooltip="当此生物被对方英雄作为目标时，其受到的正面效果和治疗能力减少30%。"